# группа [учащиеся] 
HUMANS = ['Плюх Валерий Васильевич', 'Биба Татьяна Николаевна', 'Боба Павел Александрович', 'Бульба Тарас Леонидович', 'Попова Виктория Викторовна', 'Иванов Иван Иванович', 'Канарейка Дарья Семеновна', 'Мускулов Арни Арчибальдович', 'Полоскун Енот Лесович', 'Виток Дарина Патриковна', 'Боб Джей Джонович', 'Марко Эсмиральда Григорьевна','Катод Николай Павлович', 'Ветошкин Илья Арнолдович', 'Ветошкина Мария Арнольдовна', 'Арт Денис Пикасович', 'Котик Светлана Андреевна', 'Литвинюк Наталья Вячеславовна', 'Можегова Юлия Харитоновна', 'Плакса Степан Адольфович', 'Клон Зигмунд Сигизмундович', 'Белозеров Александр Потапович', 'Шаляпин Прохор Ворфоломеевич', 'Птах Валерия Эдуардовна', 'Патсак Семен Владимирович', 'Ефремов Никита Дмитриевич', 'Дяковская Маргарита Сергеевна', 'Кравец Андрей Волфович', 'Токарева Светлана Васильевна', 'Бондарь Виолета Юревна', 'Арнтгольц Мария Витальевна', 'Ковальчук Василий Викторович', 'Гербер Фран Вольфрамовна', 'Ботан Денис Клавдиевич', 'Дроздов Святослав Максимович', 'Потак Клавдия Александровна', 'Римских Леонид Спартакович', 'Магдалена Марина Иисусовна', 'Маршал Григорий Валерьевич', 'Нижних Алина Денисовна', 'Щербаков Алексей Эдуардович', 'Силушка Добрыня Никитич', 'Прах Потап Степанович', 'Гладкая Кристина Никитична', 'Полищук Елизавета Владимировна', 'Палач Аделина Сергеевна', 'Лак Сергей Евгеньевич']

# Факультеты и кафедры
SyktGU = {
        'Институт гуманитарных наук':[
            'Кафедра философии и социально-политических наук',
            'Кафедра журналистики',
            'Кафедра связей с общественностью и рекламы',
            'Кафедра русской филологии',
            'Кафедра коми филологии, финноугроведения и регионоведения'
        ],
        'Институт естественных наук':[
            'Кафедра химии',
            'Кафедра геологии',
            'Кафедра биологии',
            'Кафедра экологии',
        ],
        'Институт иностранных языков':[
            'Кафедра иностранных языков',
            'Кафедра английского языка',
            'Кафедра немецкого и французского языков'
        ],
        'Институт истории и права':[
            'Кафедра истории России и зарубежных стран',
            'Кафедра истории и методики обучения общественно-правовым дисциплинам'
        ],
        'Институт культуры и искусства':[
            'Кафедра истории и методики обучения общественно-правовым дисциплинам',
            'Кафедра изобразительного искусства',
            'Кафедра дизайна.'
        ],
        'Медицинский институт':[
        'Кафедра фундаментальной медицины и общественного здоровья',
        'Кафедра биохимии и физиологии',
        'Кафедра неврологии, психиатрии и специальных клинических дисциплин',
        'Кафедра терапии',
        'Кафедра хирургии',
        'Кафедра педиатрии'
        ],
        'Институт экономики и управления':[
        'Кафедра финансового менеджмента',
        'Кафедра банковского дела',
        'Кафедра экономической теории и корпоративного управления',
        'Кафедра менеджмента и маркетинга'
        ]
}

# Список предметов
academic_subjects = ['Биология', 'История', 'Обществознание', 'Высшая математика', 'Информатика', 'Иностранный язык', 'Ботаника', 'Паразитология', 'Философия', 'Право', 'Физическая культура', 'Педагогика', 'Политология']

# Контактны данные и информация о человеке
HUMAN_DATE = {
                'имя': '',
                'др': '',
                'контакты': ['phone', 'mail', 'tg'],      
                'должность': '',
                'дополнительная информация': ''                
}

