name = input('Введите имя: ')
surname = input('Введите фамилию: ')
yob = input('Введите год рождения: ')
# ИСПРАВИТЬ: согласно условию данной задачи, f-строки не должны быть использованы
# ИСПРАВИТЬ: вывод не соответствует требуемому формату (неверный порядок имён)
# ИСПРАВИТЬ: согласно условию, программа должна вычислить и вывести примерный возраст, а не год рождения
print(f'{name} {surname}, {yob}')


# ДОБАВИТЬ: скопированный из терминала результат выполнения программы с собственными данными без изменений, например:
# Введите имя: Абырвалг
# Введите фамилию: Шариков
# Введите год рождения: 1889
# Абырвалг Шариков, 1889
# КОММЕНТАРИЙ: должно быть Шариков Абырвалг, 134

# КОММЕНТАРИЙ: это требование, прописанное в задании — невыполнение требований задания влечёт снижение баллов


# ИТОГ: нужно лучше, доработать — 1/5
