text = input()
print() # для удобства

for symbol in text:
    if symbol not in '.,:;!?–—\'\"()*/':
        print(symbol, end='')
        
print('.,:;!?–—\'\"()*/'.join(text))

# Повседневная практика показывает, что укрепления и развития структуры обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Не следует, однако, забывать, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения системы массового участия.

# Повседневная практика показывает что укрепления и развития структуры обеспечивает широкому кругу специалистов участие в формировании новых предложений Не следует однако забывать что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения системы массового участия

