from utils import *
text = 'Заголовок'
def main() -> str:
    print(important_message(text))
  
#========================================================# #                                                        # #                       Заголовок                        # #                                                        # #========================================================#
# >>> text = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'
# >>> msg = important_message(text)
# >>> print(msg)
#========================================================# #                                                        # #     Обратите внимание на очень важное сообщение от     # #    команды разработчиков этой великолепной программы   # #                                                        # #========================================================#
# >>>
